notes/live-coding/09-18-puzzles-in-Prolog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-18 Fri 13:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Some logic puzzles in Prolog</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="An introduction to Prolog by playing some logic games."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Some logic puzzles in Prolog</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">1. Introduction</a></li>
<li><a href="#Motivation">2. Motivation</a></li>
<li><a href="#A-note-about-fonts">3. A note about fonts</a></li>
<li><a href="#(Re)introduction-to-inference-rules">4. (Re)introduction to inference rules</a></li>
<li><a href="#Inference-rules-in-other-domains">5. Inference rules in other domains</a>
<ul>
<li>
<ul>
<li><a href="#The-two-bucket-problem">5.0.1. The two bucket problem</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#Prolog">6. Prolog</a>
<ul>
<li><a href="#The-two-bucket-problem-in-Prolog">6.1. The two bucket problem in Prolog</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-Introduction" class="outline-2">
<h2 id="Introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
These notes were created for, and in some parts <b>during</b>,
the lecture on September 18th and the following tutorials.
</p>
</div>
</div>

<div id="outline-container-Motivation" class="outline-2">
<h2 id="Motivation"><span class="section-number-2">2</span> Motivation</h2>
<div class="outline-text-2" id="text-Motivation">
<p>
Today, we begin investigating another non-imperative paradigm
other than functional programming: <i>logical programming</i>.
</p>

<p>
As we've seen in the previous hands-on lecture,
functional programming takes advantage of <i>immutability</i> in order
to make reasoning about programs easier.
It also focuses on <i>compositionality</i>, including
in its use of <i>higher-order functions</i>, all of which
makes programming very much like writing functions in mathematics
(where there is no mutable state).
</p>

<p>
Logical programming also assumes immutability,
but instead of compositionality as a method of computation,
it uses a (Turing-complete) subset of first-order predicate logic.
Programs are databases of <i>inference rules</i> describing the problem domain,
and programs are initiated by <i>queries</i> about the problem domain which
the system tries to prove are true (a logical consequence of the rules)
or false (refutable by the rules).
</p>

<p>
To put it simply, in logical programming, you describe the problem,
rather than the solution.
</p>
</div>
</div>

<div id="outline-container-A-note-about-fonts" class="outline-2">
<h2 id="A-note-about-fonts"><span class="section-number-2">3</span> A note about fonts</h2>
<div class="outline-text-2" id="text-A-note-about-fonts">
<p>
In these notes, I use plaintext blocks in order to write the
inference rules, and use em-dashes (—) to create the horizontal rules.
</p>

<p>
In some cases, the em-dashes may not show quite correctly.
For instance, in the PDF version of these notes, there is
a small space between each dash. In some browsers, they
may not show at all (they work in my install of Chrome, at least.)
</p>

<p>
Apologies for any issues reading these notes caused by this.
</p>
</div>
</div>
