notes/live-coding/09-18-puzzles-in-Prolog.org
* (Re)introduction to inference rules
:PROPERTIES:
:CUSTOM_ID: (Re)introduction-to-inference-rules
:END:

Recall: an inference rule has the form
#+begin_src text
 Premise₁   Premise₂   …   Premiseₙ
————————————————————————————————————— Rule Name
            Conclusion
#+end_src
where ~Premise₁~, ~Premise₂~, …, and ~Premiseₙ~ are some statement in our
domain, and ~Conclusion~ is a statement
that can be concluded from the premise statements.

In the domains of logics, the statements range over formulae
(i.e., boolean expressions built up from
boolean constants, predicates and propositional connectors),
and we may have rules such as
#+begin_src text
  P     Q
——————————–— ∧-Introduction
   P ∧ Q
#+end_src
which says “given ~P~ and ~Q~, we may conclude ~P ∧ Q~”,
#+begin_src text
   P ∧ Q
——————————— ∧-Eliminationˡ
     P
#+end_src
which says “given ~P ∧ Q~, we may conclude ~P~”, and
#+begin_src text
  P     P ⇒ Q
——————————————— Modus Ponens
     Q
#+end_src
which says, by translating the ~⇒~ to English,
“given ~P~ and if ~Q~ follows from ~P~, then we can conclude ~Q~”.

(Technically, these are /rule schemas/;
the /meta-variables/ ~P~ and ~Q~ can be instantiated
to obtain specific rules.)

Note that in these rules, we have the following /meta-syntax/:
1. Whitespace between premises is understood as a form of conjunction.
2. The horizontal rule is understood as a form of implication.

Any rule which does not have a premise is called an /axiom/;
axioms are the known results of our domain, which do not need to be proven.
For instance,
#+begin_src text
————————— ⊤-Introduction
  true
#+end_src

A collection of inference rules (or rule schemas)
and axioms gives us a /proof system/.

See, for instance,
the [[https://cs.uwaterloo.ca/~david/cl/natural-deduction-pfenning.pdf][natural deduction]] proof calculus
for classical logic.

You have likely seen the /equational/ approach to proofs
which is favoured by Gries and Schneider's
“A Logical Approach to Discrete Math”, and used in
[[https://www.cas.mcmaster.ca/~kahl/CS2DM3/2020/][CS/SE 2dm3 at McMaster]]
using the [[http://calccheck.mcmaster.ca/][CalcCheck tool]].
Proof systems are an alternate approach to proof;
see [[https://alhassy.github.io/CalcCheck/LectureNotes.html#Rules-of-Equality-and-Proof-Trees-vs-Calculational-Proofs][Musa's notes on the relationship]] from this year's 2dm3.

Inside of a proof system, we may construct proofs of statements
via /proof trees/, which are trees where every node is a statement,
and the connections between nodes correspond to the use of rules.

For instance, we have the following silly proof of ~true~ which
uses the rules given above.
#+begin_src text
—————— ⊤-introduction        —————— ⊤ introduction
 true                         true
——————————————————————————————————— ∧-Eliminationˡ
          true ∧ true
       ————————————————— ∧-Eliminationˡ
              true
#+end_src

Notice, by convention, we write proof trees
from the *bottom up*.
The root, at the bottom, is what we intend to prove.
The leaves, at the top, must either
1. be axioms, or
2. be local assumptions.

Proof trees may be read from the top down,
to see how the conclusion follows from the axioms and assumptions.
It is generally better to read from the bottom up, though;
otherwise the proof often seems to make
unwarrented steps, or informally, it “pulls a rabbit from its hat”.
   
* Inference rules in other domains
:PROPERTIES:
:CUSTOM_ID: Inference-rules-in-other-domains
:END:

The use of inference rules is not limited to the domain of logics.

It is perhaps better not to think of inference rules
as defining a /proof system/ (which makes us think
of truth values and logics),
but as defining a /game/: starting from
the rules and axioms, what can we obtain?

For instance, consider the following problem.

*** The two bucket problem
:PROPERTIES:
:CUSTOM_ID: The-two-bucket-problem
:END:

