notes/live-coding/09-18-puzzles-in-Prolog.tex

\section{(Re)introduction to inference rules}
\label{sec:orgf6e3cbd}
Recall: an inference rule has the form
\begin{minted}[breaklines=true]{text}
 Premise₁   Premise₂   …   Premiseₙ
————————————————————————————————————— Rule Name
            Conclusion
\end{minted}
where \texttt{Premise₁}, \texttt{Premise₂}, …, and \texttt{Premiseₙ} are some statements in our
domain, and \texttt{Conclusion} is a statement
that can be concluded from the premise statements.

In the domains of logics, the statements range over formulae
(i.e., boolean expressions built up from
boolean constants, predicates and propositional connectors),
and we may have rules such as
\begin{minted}[breaklines=true]{text}
  P     Q
———————————— ∧-Introduction
   P ∧ Q
\end{minted}
which says “given \texttt{P} and \texttt{Q}, we may conclude \texttt{P ∧ Q}”,
\begin{minted}[breaklines=true]{text}
   P ∧ Q
——————————— ∧-Eliminationˡ
     P
\end{minted}
which says “given \texttt{P ∧ Q}, we may conclude \texttt{P}”, and
\begin{minted}[breaklines=true]{text}
  P     P ⇒ Q
——————————————— Modus Ponens
     Q
\end{minted}
which says, by translating the \texttt{⇒} to English,
“given \texttt{P} and if \texttt{Q} follows from \texttt{P}, then we can conclude \texttt{Q}”.

(Technically, these are \emph{rule schemas};
the \emph{meta-variables} \texttt{P} and \texttt{Q} can be instantiated
to obtain specific rules.)

Note that in these rules, we have the following \emph{meta-syntax}:
\begin{enumerate}
\item Whitespace between premises is understood as a form of conjunction.
\item The horizontal rule is understood as a form of implication.
\end{enumerate}

Any rule which does not have a premise is called an \emph{axiom};
axioms are the known results of our domain, which do not need to be proven.
For instance,
\begin{minted}[breaklines=true]{text}
————————— ⊤-Introduction
  true
\end{minted}

A collection of inference rules (or rule schemas)
and axioms gives us a \emph{proof system}.

See, for instance,
the \href{https://cs.uwaterloo.ca/\~david/cl/natural-deduction-pfenning.pdf}{natural deduction} proof calculus
for classical logic.

You have likely seen the \emph{equational} approach to proofs
which is favoured by Gries and Schneider's
“A Logical Approach to Discrete Math”, and used in
\href{https://www.cas.mcmaster.ca/\~kahl/CS2DM3/2020/}{CS/SE 2dm3 at McMaster}
using the \href{http://calccheck.mcmaster.ca/}{CalcCheck tool}.
Proof systems are an alternate approach to proof;
see \href{https://alhassy.github.io/CalcCheck/LectureNotes.html\#Rules-of-Equality-and-Proof-Trees-vs-Calculational-Proofs}{Musa's notes on the relationship} from this year's 2dm3.

Inside of a proof system, we may construct proofs of statements
via \emph{proof trees}, which are trees where every node is a statement,
and the connections between nodes correspond to the use of rules.

For instance, we have the following silly proof of \texttt{true} which
uses the rules given above.
\begin{minted}[breaklines=true]{text}
—————— ⊤-Introduction        —————— ⊤-Introduction
 true                         true
——————————————————————————————————— ∧-Introductionˡ
          true ∧ true
       ————————————————— ∧-Eliminationˡ
             true
\end{minted}

Notice, by convention, we write proof trees
from the \textbf{bottom up}.
The root, at the bottom, is what we intend to prove.
The leaves, at the top, must either
\begin{enumerate}
\item be axioms, or
\item be local assumptions.
\end{enumerate}

Proof trees may be read from the top down,
to see how the conclusion follows from the axioms and assumptions.
It is generally better to read from the bottom up, though;
otherwise the proof often seems to make
unwarranted steps, or informally, it “pulls a rabbit from its hat”.

\section{Inference rules in other domains}
\label{sec:org2d82588}
The use of inference rules is not limited to the domain of logics.

It is perhaps better not to think of inference rules
as defining a \emph{proof system} (which makes us think
of truth values and logics),
but as defining a \emph{game}: starting from
the rules and axioms, what can we obtain?

For instance, consider the following problem.
