notes/live-coding/09-18-puzzles-in-Prolog.org
**** The problem
:PROPERTIES:
:CUSTOM_ID: The-problem
:END:

Suppose you are given two buckets,
- one of which holds 5 units of water, and
- one of which holds 3 units of water.

You are tasked with collecting exactly 4 units of water;
no more, and no less.
You begin with 0 units in both buckets.

You may at any point
- fill one bucket entirely from a tap,
- pour the water out of a bucket, emptying it entirely.
- pour one bucket into another until either the first is empty
  or the second is full, or

You are tasked with collecting exactly 4 units of water
using only those three kinds of actions.

**** The rules
:PROPERTIES:
:CUSTOM_ID: The-rules
:END:

Let us represent the state of the bucket by a pair of numbers.
In these rules, we will use
- ~x~ as a meta-variable for the amount
  in the bucket which can hold 5 units, and
- ~y~ as a meta-variable for the amount
  in the bucket which can hold 3 units.

We can begin only if we have 0 units in both buckets.
#+begin_src text

          ––––––––— Start
            0 , 0
#+end_src

The action of filling a bucket replaces its current amount
with the maximum amount.
#+begin_src text
  X , Y                  X , Y
––––––––— Fillˡ        ––––––––– Fillʳ
  5 , Y                  X , 3
#+end_src

:TODO:
#+begin_src text
  X , Y                  X , Y
––––––––— Emptyˡ       ––––––––– Emptyʳ
  ? , ?                  ? , ?  
#+end_src

:TODO:
#+begin_src text
  X , Y        
––––––––— Pourˡ   (provided ???)
  ? , ?        

  X , Y        
––––––––– Pourʳ   (provided ???)
  ? , ?
#+end_src
* Prolog
:PROPERTIES:
:CUSTOM_ID: Prolog
:END:

Prolog programs are simply databases of inference rules.
An inference rule
#+begin_src text
 A₁   A₂   …   Aₙ
––––––––––––––––––––
      B
#+end_src
is written in Prolog
#+begin_src prolog
b :- a1, a2, …, an.
#+end_src
(notice the period ending the rule).
As with our inference rule, this rule states that
~b~ is true if all of the ~aᵢ~ are true.
So we can think of ~:-~ as ~⇐~, and ~,~ as ~∧~.

An axiom
#+begin_src text
––––––––––––––
      C
#+end_src
can be written in Prolog as
#+begin_src prolog
c :- true.
#+end_src
or, more simply,
#+begin_src prolog
c.
#+end_src

:TODO:

** The two bucket problem in Prolog
:PROPERTIES:
:CUSTOM_ID: The-two-bucket-problem-in-Prolog
:END:

We can begin only if we have 0 units in both buckets.
#+begin_src prolog :tangle src/sept18-buckets.pl
bucket(0,0).
#+end_src

The action of filling a bucket replaces its current amount
with the maximum amount.
#+begin_src prolog :tangle src/sept18-buckets.pl

#+end_src

