notes/live-coding/09-18-puzzles-in-Prolog.html

<div id="outline-container-The-two-bucket-problem" class="outline-4">
<h4 id="The-two-bucket-problem"><span class="section-number-4">5.0.1</span> The two bucket problem</h4>
<div class="outline-text-4" id="text-The-two-bucket-problem">
</div>

<ol class="org-ol">
<li><a id="The-problem"></a>The problem<br />
<div class="outline-text-5" id="text-The-problem">
<p>
Suppose you are given two buckets,
</p>
<ul class="org-ul">
<li>one of which holds 5 units of water, and</li>
<li>one of which holds 3 units of water.</li>
</ul>

<p>
You are tasked with collecting exactly 4 units of water;
no more, and no less.
You begin with 0 units in both buckets.
</p>

<p>
You may at any point
</p>
<ul class="org-ul">
<li>fill one bucket entirely from a tap,</li>
<li>pour the water out of a bucket, emptying it entirely.</li>
<li>pour one bucket into another until either the first is empty
or the second is full, or</li>
</ul>

<p>
You are tasked with collecting exactly 4 units of water
using only those three kinds of actions.
</p>
</div>
</li>

<li><a id="The-rules"></a>The rules<br />
<div class="outline-text-5" id="text-The-rules">
<p>
Let us represent the state of the bucket by a pair of numbers.
In these rules, we will use
</p>
<ul class="org-ul">
<li><code>x</code> as a meta-variable for the amount
in the bucket which can hold 5 units, and</li>
<li><code>y</code> as a meta-variable for the amount
in the bucket which can hold 3 units.</li>
</ul>

<p>
We can begin only if we have 0 units in both buckets.
</p>
<div class="org-src-container">
<pre class="src src-text">
          &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8212; Start
            0 , 0
</pre>
</div>

<p>
The action of filling a bucket replaces its current amount
with the maximum amount.
</p>
<div class="org-src-container">
<pre class="src src-text">  X , Y                  X , Y
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8212; Fill&#737;        &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; Fill&#691;
  5 , Y                  X , 3
</pre>
</div>

<p>
:TODO:
</p>
<div class="org-src-container">
<pre class="src src-text">  X , Y                  X , Y
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8212; Empty&#737;       &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; Empty&#691;
  ? , ?                  ? , ?  
</pre>
</div>

<p>
:TODO:
</p>
<div class="org-src-container">
<pre class="src src-text">  X , Y        
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8212; Pour&#737;   <span style="color: #00cd68;">(</span>provided ???<span style="color: #00cd68;">)</span>
  ? , ?        

  X , Y        
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; Pour&#691;   <span style="color: #00cd68;">(</span>provided ???<span style="color: #00cd68;">)</span>
  ? , ?
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-Prolog" class="outline-2">
<h2 id="Prolog"><span class="section-number-2">6</span> Prolog</h2>
<div class="outline-text-2" id="text-Prolog">
<p>
Prolog programs are simply databases of inference rules.
An inference rule
</p>
<div class="org-src-container">
<pre class="src src-text"> A&#8321;   A&#8322;   &#8230;   A&#8345;
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;
      B
</pre>
</div>
<p>
is written in Prolog
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #feacd0;">b</span> :- a1, a2, &#8230;, an.
</pre>
</div>
<p>
(notice the period ending the rule).
As with our inference rule, this rule states that
<code>b</code> is true if all of the <code>aᵢ</code> are true.
So we can think of <code>:-</code> as <code>⇐</code>, and <code>,</code> as <code>∧</code>.
</p>

<p>
An axiom
</p>
<div class="org-src-container">
<pre class="src src-text">&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;
      C
</pre>
</div>
<p>
can be written in Prolog as
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #feacd0;">c</span> :- true.
</pre>
</div>
<p>
or, more simply,
</p>
<div class="org-src-container">
<pre class="src src-prolog">c.
</pre>
</div>

<p>
:TODO:
</p>
</div>

<div id="outline-container-The-two-bucket-problem-in-Prolog" class="outline-3">
<h3 id="The-two-bucket-problem-in-Prolog"><span class="section-number-3">6.1</span> The two bucket problem in Prolog</h3>
<div class="outline-text-3" id="text-The-two-bucket-problem-in-Prolog">
<p>
We can begin only if we have 0 units in both buckets.
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #feacd0;">bucket</span><span style="color: #00cd68;">(</span>0,0<span style="color: #00cd68;">)</span>.
</pre>
</div>

<p>
The action of filling a bucket replaces its current amount
with the maximum amount.
</p>
<div class="org-src-container">
<pre class="src src-prolog">
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: </p>
     <p class="date">Last updated: 2020-09-18 Fri 13:38</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.90 (<a href="https://orgmode.org">Org</a> mode 9.3.8)</p>
     <p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
