notes/live-coding/09-18-puzzles-in-Prolog.tex

\subsection{The two bucket problem}
\label{sec:org8f2c935}
\subsubsection{The problem}
\label{sec:orgf49d294}
Suppose you are given two buckets,
\begin{itemize}
\item one of which holds 5 units of water, and
\item one of which holds 3 units of water.
\end{itemize}

You are tasked with collecting exactly 4 units of water;
no more, and no less.
You begin with 0 units in both buckets.

You may at any point
\begin{itemize}
\item fill one bucket entirely from a tap,
\item pour the water out of a bucket, emptying it entirely, or
\item pour one bucket into another until either the first is empty
or the second is full.
\end{itemize}

You are tasked with collecting exactly 4 units of water
using only those three kinds of actions.

\subsubsection{The rules}
\label{sec:orgd3c2a37}
Let us represent the state of the bucket by a pair of numbers.
In these rules, we will use
\begin{itemize}
\item \texttt{x} as a meta-variable for the amount
in the bucket which can hold 5 units, and
\item \texttt{y} as a meta-variable for the amount
in the bucket which can hold 3 units.
\end{itemize}

We can begin only if we have 0 units in both buckets.
\begin{minted}[breaklines=true]{text}

          ––––––––— Start
            0 , 0
\end{minted}

The action of filling a bucket replaces its current amount
with the maximum amount.
\begin{minted}[breaklines=true]{text}
  X , Y                  X , Y
––––––––— Fillˡ        ––––––––– Fillʳ
  5 , Y                  X , 3
\end{minted}

The action of emptying a bucket replaces its current amount
with 0.
\begin{minted}[breaklines=true]{text}
  X , Y                  X , Y
––––––––— Emptyˡ       ––––––––– Emptyʳ
  0 , Y                  X , 0  
\end{minted}

:TODO:
\begin{minted}[breaklines=true]{text}
     X , Y        
–—–––––––————–– Pourˡ   (provided (X + D = 5) ∨ (Y - D = 0))
 X + D , Y - D

  X , Y        
––––––––––––––— Pourʳ   (provided (X - D = 0) ∨ (Y + D = 3))
 X - D , Y + D
\end{minted}

\section{Prolog}
\label{sec:org7111e3f}
Prolog programs are simply databases of inference rules.
An inference rule
\begin{minted}[breaklines=true]{text}
 A₁   A₂   …   Aₙ
––––––––––––––––––––
      B
\end{minted}
is written in Prolog
\begin{minted}[breaklines=true]{prolog}
b :- a1, a2, …, an.
\end{minted}
(notice the period ending the rule).
As with our inference rule, this rule states that
\texttt{b} is true if all of the \texttt{aᵢ} are true.
So we can think of \texttt{:-} as \texttt{⇐}, and \texttt{,} as \texttt{∧}.

An axiom
\begin{minted}[breaklines=true]{text}
––––––––––––––
      C
\end{minted}
can be written in Prolog as
\begin{minted}[breaklines=true]{prolog}
c :- true.
\end{minted}
or, more simply,
\begin{minted}[breaklines=true]{prolog}
c.
\end{minted}

:TODO:

\subsection{The two bucket problem in Prolog}
\label{sec:orga8baaa7}
We can begin only if we have 0 units in both buckets.
\begin{minted}[breaklines=true]{prolog}
buckets(0,0).
\end{minted}

The action of filling a bucket replaces its current amount
with the maximum amount.
\begin{minted}[breaklines=true]{prolog}
buckets(0,Y) :- buckets(_X,Y).
buckets(X,0) :- buckets(X,_Y).
\end{minted}
\end{document}
